app/views/copies/index.html.erb

SELECT "copies".* FROM "copies" WHERE "copies"."user_id" = ?  [["user_id", 1]]
---
<div>
  <% current_user.copies.each do |copy| %>