app/views/users/show.html.erb

SELECT "copies".* FROM "copies" WHERE "copies"."user_id" = ?  [["user_id", 1]]
---
<div class="row">
  <% @user.copies.each do |copy| %>