app/views/friendships/index.html.erb

<ul>
<% current_user.friendships.each do |friendship| %>
---
SELECT "friendships".* FROM "friendships" WHERE "friendships"."user_id" = ?  [["user_id", 1]]