app/views/lendings/new.html.erb

SELECT "copies".* FROM "copies" WHERE "copies"."book_id" = ? AND "copies"."user_id" IN (?, ?, ?, ?)  [["book_id", 3], ["user_id", 2], ["user_id", 3], ["user_id", 4], ["user_id", 5]]
---
        <div>
        <% book.friend_copies(current_user).each do |copy| %>