app/controllers/books_controller.rb

	def create
		@book = Book.new(book_params)
		if @book.valid?
			@book.save
			@copy = Copy.create(book_id: @book.id, user_id:current_user.id)
---
INSERT INTO "books" ("name", "isbn", "author", "short_description", "info_link", "cover_img", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "copies" ("book_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["book_id", 7], ["user_id", 1], ["created_at", "2018-05-30 20:11:13.729541"], ["updated_at", "2018-05-30 20:11:13.729541"]]