app/controllers/copies_controller.rb

  def find_copy
    @copy = Copy.find_by(id: params[:id])
---
SELECT  "copies".* FROM "copies" WHERE "copies"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]