app/controllers/friendships_controller.rb

	def destroy
		Friendship.find_by(id: params[:id]).destroy
---
DELETE FROM "friendships" WHERE "friendships"."id" = ?  [["id", 1]]
SELECT  "friendships".* FROM "friendships" WHERE "friendships"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def create
		Friendship.create(friendship_params)
---
INSERT INTO "friendships" ("user_id", "friend_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["friend_id", 5], ["created_at", "2018-05-30 15:11:28.205923"], ["updated_at", "2018-05-30 15:11:28.205923"]]