app/controllers/lendings_controller.rb

INSERT INTO "lendings" ("copy_id", "borrower_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["copy_id", 3], ["borrower_id", 1], ["created_at", "2018-05-31 13:47:51.138136"], ["updated_at", "2018-05-31 13:47:51.138136"]]
---
  def create
    @lending = Lending.new(lending_params)
    @lending.save

SELECT  "lendings".* FROM "lendings" WHERE "lendings"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "lendings" SET "due_date" = ?, "lend_date" = ?, "status" = ?, "updated_at" = ? WHERE "lendings"."id" = ?  [["due_date", "2018-06-30 18:53:29"], ["lend_date", "2018-05-31 18:53:29"], ["status", "active"], ["updated_at", "2018-05-31 18:53:35.128708"], ["id", 17]]
---
  def update
    @lending = Lending.find_by(id: params[:id])
    @lending.lend_date = Time.now
    @lending.status = "active"
    # if @lending.valid?
    @lending.save