app/controllers/sessions_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at", "uid", "image") VALUES (?, ?, ?, ?, ?, ?, ?)
SELECT  "users".* FROM "users" WHERE "users"."uid" = ? LIMIT ?  [["uid", "10156735736717345"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "fionna@fionna.com"], ["LIMIT", 1]]
---
	def create
		if auth #if login with omniauth-facebook
		    @user = User.find_or_create_by(uid: auth['uid']) do |u|
		      u.name = auth['info']['name']
		      u.email = auth['info']['email']
		      u.image = auth['info']['image']
		      u.password_digest = "0"
		    end
		    session[:user_id] = @user.id
		    redirect_to library_path

		else # if login with password

			@user = User.find_by(email: params[:email])