app/models/copy.rb

  def current_lending
    Lending.where("returned = ? AND copy_id = ?", false, self.id)
---
SELECT  "lendings".* FROM "lendings" WHERE "lendings"."copy_id" = ? AND (status = 'active') ORDER BY "lendings"."id" ASC LIMIT ?  [["copy_id", 1], ["LIMIT", 1]]

  def available?
    self.current_lending.empty? ? true : false
---
SELECT  "lendings".* FROM "lendings" WHERE "lendings"."copy_id" = ? AND (status = 'active') ORDER BY "lendings"."id" ASC LIMIT ?  [["copy_id", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "lendings" WHERE (returned = 0 AND copy_id = 1) LIMIT ?  [["LIMIT", 1]]