app/models/friendship.rb

SELECT  "friendships".* FROM "friendships" WHERE "friendships"."user_id" = ? AND "friendships"."friend_id" = ? LIMIT ?  [["user_id", 2], ["friend_id", 1], ["LIMIT", 1]]
INSERT INTO "friendships" ("user_id", "friend_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["friend_id", 1], ["created_at", "2018-05-29 19:19:16.309816"], ["updated_at", "2018-05-29 19:19:16.309816"]]
---
  def create_inverse_relationship
    if !friend.friendships.find_by(friend_id: user.id)
     friend.friendships.create(friend: user)

SELECT  "friendships".* FROM "friendships" WHERE "friendships"."user_id" = ? AND "friendships"."friend_id" = ? LIMIT ?  [["user_id", 2], ["friend_id", 1], ["LIMIT", 1]]
DELETE FROM "friendships" WHERE "friendships"."id" = ?  [["id", 2]]
---
  def destroy_inverse_relationship
    friendship = friend.friendships.find_by(friend: user)
    friendship.destroy if friendship