app/models/user.rb

    def friend?(user)
      self.friends.include?(user)
---
SELECT "users".* FROM "users" INNER JOIN "friendships" ON "users"."id" = "friendships"."friend_id" WHERE "friendships"."user_id" = ?  [["user_id", 1]]

    def friend_copies
      Copy.where(user_id: friend_ids)
---
SELECT "copies".* FROM "copies" WHERE "copies"."user_id" = ?  [["user_id", 2]]

    def friend_books
      friend_copies.map {|copy| copy.book}
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def past_unrated_borrowers
      self.lendings.where("status IS ? AND borrower_rating IS ?", "returned", nil )
---
SELECT AVG("lendings"."rating") FROM "lendings" WHERE "lendings"."borrower_id" = ? AND (status IS 'returned' AND rating IS NOT NULL)  [["borrower_id", 1]]

    def self_copies
      self.copies.select { |copy| copy.available?  }
---
SELECT "copies".* FROM "copies" WHERE "copies"."user_id" = ?  [["user_id", 3]]